In [1]:
import pandas as pd

In [4]:
train_dataframe = pd.read_csv(r"datasets\train.csv")
features_dataframe = pd.read_csv(r"datasets\features.csv")
stores_dataframe = pd.read_csv(r"datasets\stores.csv")

In [5]:
train_dataframe

        Store  Dept        Date  Weekly_Sales  IsHoliday
0           1     1  2010-02-05      24924.50      False
1           1     1  2010-02-12      46039.49       True
2           1     1  2010-02-19      41595.55      False
3           1     1  2010-02-26      19403.54      False
4           1     1  2010-03-05      21827.90      False
...       ...   ...         ...           ...        ...
421565     45    98  2012-09-28        508.37      False
421566     45    98  2012-10-05        628.10      False
421567     45    98  2012-10-12       1061.02      False
421568     45    98  2012-10-19        760.01      False
421569     45    98  2012-10-26       1076.80      False

[421570 rows x 5 columns]

In [6]:
features_dataframe

,Store,Date,Temperature,Fuel_Price,MarkDown1,MarkDown2,MarkDown3,MarkDown4,MarkDown5,CPI,Unemployment,IsHoliday
0,1,2010-02-05,42.31,2.572,NaN,NaN,NaN,NaN,NaN,211.096358,8.106,False
1,1,2010-02-12,38.51,2.548,NaN,NaN,NaN,NaN,NaN,211.242170,8.106,True
2,1,2010-02-19,39.93,2.514,NaN,NaN,NaN,NaN,NaN,211.289143,8.106,False
3,1,2010-02-26,46.63,2.561,NaN,NaN,NaN,NaN,NaN,211.319643,8.106,False
4,1,2010-03-05,46.50,2.625,NaN,NaN,NaN,NaN,NaN,211.350143,8.106,False
...,...,...,...,...,...,...,...,...,...,...,...,...
8185,45,2013-06-28,76.05,3.639,4842.29,975.03,3.00,2449.97,3169.69,NaN,NaN,False
8186,45,2013-07-05,77.50,3.614,9090.48,2268.58,582.74,5797.47,1514.93,NaN,NaN,False
8187,45,2013-07-12,79.37,3.614,3789.94,1827.31,85.72,744.84,2150.36,NaN,NaN,False
8188,45,2013-07-19,82.84,3.737,2961.49,1047.07,204.19,363.00,1059.46,NaN,NaN,False
8189,45,2013-07-26,76.06,3.804,212.02,851.73,2.06,10.88,1864.57,NaN,NaN,False

In [7]:
stores_dataframe

    Store Type    Size
0       1    A  151315
1       2    A  202307
2       3    B   37392
3       4    A  205863
4       5    B   34875
5       6    A  202505
6       7    B   70713
7       8    A  155078
8       9    B  125833
9      10    B  126512
10     11    A  207499
11     12    B  112238
12     13    A  219622
13     14    A  200898
14     15    B  123737
15     16    B   57197
16     17    B   93188
17     18    B  120653
18     19    A  203819
19     20    A  203742
20     21    B  140167
21     22    B  119557
22     23    B  114533
23     24    A  203819
24     25    B  128107
25     26    A  152513
26     27    A  204184
27     28    A  206302
28     29    B   93638
29     30    C   42988
30     31    A  203750
31     32    A  203007
32     33    A   39690
33     34    A  158114
34     35    B  103681
35     36    A   39910
36     37    C   39910
37     38    C   39690
38     39    A  184109
39     40    A  155083
40     41    A  196321
41     42    C   39690
42     43    C   41062
43     44    C   39910
44     45    B  118221

### Exploring the dataset

***1. Train Dataset***

In [10]:
print("Shape of dataset:", train_dataframe.shape)

Shape of dataset: (421570, 5)

In [11]:
print("First 5 rows:")
train_dataframe.head()

First 5 rows:

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  2010-02-05      24924.50      False
1      1     1  2010-02-12      46039.49       True
2      1     1  2010-02-19      41595.55      False
3      1     1  2010-02-26      19403.54      False
4      1     1  2010-03-05      21827.90      False

In [13]:
print("Last 5 rows:")
train_dataframe.tail()

Last 5 rows:

        Store  Dept        Date  Weekly_Sales  IsHoliday
421565     45    98  2012-09-28        508.37      False
421566     45    98  2012-10-05        628.10      False
421567     45    98  2012-10-12       1061.02      False
421568     45    98  2012-10-19        760.01      False
421569     45    98  2012-10-26       1076.80      False

***Summary statistics for numeric columns***

In [15]:
print(train_dataframe.describe())

               Store           Dept   Weekly_Sales
count  421570.000000  421570.000000  421570.000000
mean       22.200546      44.260317   15981.258123
std        12.785297      30.492054   22711.183519
min         1.000000       1.000000   -4988.940000
25%        11.000000      18.000000    2079.650000
50%        22.000000      37.000000    7612.030000
75%        33.000000      74.000000   20205.852500
max        45.000000      99.000000  693099.360000

In [20]:
# Summary statistics
summary = train_dataframe['Weekly_Sales'].describe()

print(f"Weekly_Sales has a mean of  {summary['mean']:.0f} and a maximum of {summary['max']:.0f}.")
print(f"The minimum Weekly_Sales is {summary['min']}, which means some sales are negative")
print(f"There are total records of {int(summary['count'])} in the dataset.")

Weekly_Sales has a mean of  15981 and a maximum of 693099.
The minimum Weekly_Sales is -4988.94, which means some sales are negative
There are total records of 421570 in the dataset.

***checking the total of null values***

In [22]:
print(train_dataframe.isnull().sum())

Store           0
Dept            0
Date            0
Weekly_Sales    0
IsHoliday       0
dtype: int64

In [23]:
train_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  object
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), float64(1), int64(2), object(1)
memory usage: 13.3+ MB

***Value counts for categorical variables***

In [27]:
print("Top 5 Stores in dataset:")
print(train_dataframe["Store"].value_counts().head(5))

print("Top 5 Departments in dataset:")
print(train_dataframe["Dept"].value_counts().head(5))

print("Top 5 Weekly Sales values:")
print(train_dataframe["Weekly_Sales"].value_counts().head(5))

Top 5 Stores in dataset:
Store
13    10474
10    10315
4     10272
1     10244
2     10238
Name: count, dtype: int64
Top 5 Departments in dataset:
Dept
1     6435
16    6435
92    6435
38    6435
40    6435
Name: count, dtype: int64
Top 5 Weekly Sales values:
Weekly_Sales
10.0    353
5.0     289
20.0    232
15.0    215
12.0    175
Name: count, dtype: int64

***2.Features Dataset***

In [29]:
print("Shape of Features dataset:", features_dataframe.shape)
print("Preview of Features dataset:")
print(features_dataframe.head())

Shape of Features dataset: (8190, 12)
Preview of Features dataset:
   Store        Date  Temperature  Fuel_Price  MarkDown1  MarkDown2  \
0      1  2010-02-05        42.31       2.572        NaN        NaN
1      1  2010-02-12        38.51       2.548        NaN        NaN
2      1  2010-02-19        39.93       2.514        NaN        NaN
3      1  2010-02-26        46.63       2.561        NaN        NaN
4      1  2010-03-05        46.50       2.625        NaN        NaN

   MarkDown3  MarkDown4  MarkDown5         CPI  Unemployment  IsHoliday
0        NaN        NaN        NaN  211.096358         8.106      False
1        NaN        NaN        NaN  211.242170         8.106       True
2        NaN        NaN        NaN  211.289143         8.106      False
3        NaN        NaN        NaN  211.319643         8.106      False
4        NaN        NaN        NaN  211.350143         8.106      False

***Summary stats for numerical features***

In [31]:
print("Statistical Summary:")
print(features_dataframe.describe())

Statistical Summary:
             Store  Temperature   Fuel_Price      MarkDown1      MarkDown2  \
count  8190.000000  8190.000000  8190.000000    4032.000000    2921.000000
mean     23.000000    59.356198     3.405992    7032.371786    3384.176594
std      12.987966    18.678607     0.431337    9262.747448    8793.583016
min       1.000000    -7.290000     2.472000   -2781.450000    -265.760000
25%      12.000000    45.902500     3.041000    1577.532500      68.880000
50%      23.000000    60.710000     3.513000    4743.580000     364.570000
75%      34.000000    73.880000     3.743000    8923.310000    2153.350000
max      45.000000   101.950000     4.468000  103184.980000  104519.540000

           MarkDown3     MarkDown4      MarkDown5          CPI  Unemployment
count    3613.000000   3464.000000    4050.000000  7605.000000   7605.000000
mean     1760.100180   3292.935886    4132.216422   172.460809      7.826821
std     11276.462208   6792.329861   13086.690278    39.738346      1.877259
min      -179.260000      0.220000    -185.170000   126.064000      3.684000
25%         6.600000    304.687500    1440.827500   132.364839      6.634000
50%        36.260000   1176.425000    2727.135000   182.764003      7.806000
75%       163.150000   3310.007500    4832.555000   213.932412      8.567000
max    149483.310000  67474.850000  771448.100000   228.976456     14.313000

***Check for missing data***

In [32]:
print("Missing values in Features dataset:")
print(features_dataframe.isnull().sum())

Missing values in Features dataset:
Store              0
Date               0
Temperature        0
Fuel_Price         0
MarkDown1       4158
MarkDown2       5269
MarkDown3       4577
MarkDown4       4726
MarkDown5       4140
CPI              585
Unemployment     585
IsHoliday          0
dtype: int64

***Unique values for categorical/binary fields***

In [36]:
unique_stores = features_dataframe['Store'].nunique()
print(f"Unique Stores: {unique_stores}")

Unique Stores: 45

***3.Stores Dataset***

***Show shape and preview***

In [48]:
print(f"Dataset shape: {stores_dataframe.shape}")
print("First 5 rows:")
stores_dataframe.head(5)

Dataset shape: (45, 3)
First 5 rows:

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [47]:
print("Last 5 rows:")
stores_dataframe.tail(5)

Last 5 rows:

    Store Type    Size
40     41    A  196321
41     42    C   39690
42     43    C   41062
43     44    C   39910
44     45    B  118221

In [39]:
print("Column data types:")
print(stores_dataframe.dtypes)

Column data types:
Store     int64
Type     object
Size      int64
dtype: object

***Check for missing values***

In [40]:
print(stores_dataframe.isnull().sum())

Store    0
Type     0
Size     0
dtype: int64

***Summary statistics for numeric columns***

In [41]:
print("Summary statistics:")
print(stores_dataframe.describe())

Summary statistics:
           Store           Size
count  45.000000      45.000000
mean   23.000000  130287.600000
std    13.133926   63825.271991
min     1.000000   34875.000000
25%    12.000000   70713.000000
50%    23.000000  126512.000000
75%    34.000000  202307.000000
max    45.000000  219622.000000

In [43]:
# Total stores
summary = stores_dataframe.describe()
print(f"- Total number of stores: {int(summary['Store']['count'])}")

- Total number of stores: 45

In [44]:
print(f"- Smallest store: {int(summary['Size']['min'])}")
print(f"- Largest store: {int(summary['Size']['max'])}")
print(f"- Average store size: {int(summary['Size']['mean'])}")
print(f"- Median store size: {int(summary['Size']['50%'])}")

- Smallest store: 34875
- Largest store: 219622
- Average store size: 130287
- Median store size: 126512

### Aggregation with groupby()

***Total sales by store***

In [50]:
sales_by_store = train_dataframe.groupby('Store')['Weekly_Sales'].sum()
print(sales_by_store.head())

Store
1    2.224028e+08
2    2.753824e+08
3    5.758674e+07
4    2.995440e+08
5    4.547569e+07
Name: Weekly_Sales, dtype: float64

***Total sales by department***

In [51]:
sales_by_dept = train_dataframe.groupby('Dept')['Weekly_Sales'].sum()
print(sales_by_dept.head())

Dept
1    1.236388e+08
2    2.806112e+08
3    7.589245e+07
4    1.671467e+08
5    1.356074e+08
Name: Weekly_Sales, dtype: float64

### Merging datasets

In [53]:
merged_df = pd.merge(train_dataframe, features_dataframe, on=['Store', 'Date'])
print(merged_df.head())

   Store  Dept        Date  Weekly_Sales  IsHoliday_x  Temperature  \
0      1     1  2010-02-05      24924.50        False        42.31
1      1     1  2010-02-12      46039.49         True        38.51
2      1     1  2010-02-19      41595.55        False        39.93
3      1     1  2010-02-26      19403.54        False        46.63
4      1     1  2010-03-05      21827.90        False        46.50

   Fuel_Price  MarkDown1  MarkDown2  MarkDown3  MarkDown4  MarkDown5  \
0       2.572        NaN        NaN        NaN        NaN        NaN
1       2.548        NaN        NaN        NaN        NaN        NaN
2       2.514        NaN        NaN        NaN        NaN        NaN
3       2.561        NaN        NaN        NaN        NaN        NaN
4       2.625        NaN        NaN        NaN        NaN        NaN

          CPI  Unemployment  IsHoliday_y
0  211.096358         8.106        False
1  211.242170         8.106         True
2  211.289143         8.106        False
3  211.319643         8.106        False
4  211.350143         8.106        False

### Concatenating data

In [62]:
week1 = train_dataframe[train_df['Date'] == '2011-01-07']
week2 = train_dataframe[train_df['Date'] == '2011-01-14']

combined_weeks = pd.concat([week1, week2])

combined_weeks.shape
combined_weeks.head()

     Store  Dept        Date  Weekly_Sales  IsHoliday
48       1     1  2011-01-07      15984.24      False
191      1     2  2011-01-07      43202.29      False
334      1     3  2011-01-07      15808.15      False
477      1     4  2011-01-07      37947.80      False
620      1     5  2011-01-07      22699.69      False

In [63]:
combined_weeks.head()

     Store  Dept        Date  Weekly_Sales  IsHoliday
48       1     1  2011-01-07      15984.24      False
191      1     2  2011-01-07      43202.29      False
334      1     3  2011-01-07      15808.15      False
477      1     4  2011-01-07      37947.80      False
620      1     5  2011-01-07      22699.69      False